/**
 *  touch_sensor.c
 *
 *  Get and update parameter of touch sensor value.
 */
#include "ev3api.h"
#include "ev3portconf.h"
 
/*****************************************************************************/
/*                                  変数定義                                 */
/*****************************************************************************/
bool_t touch_sensor_state;
int touch_sensor_config = -1;

/*****************************************************************************/
/*                                  静的変数                                 */
/*****************************************************************************/


/*****************************************************************************/
/*                                  定数定義                                 */
/*****************************************************************************/
const sensor_port_t touch_sensor_port = TOUCH_SENSOR_PORT;

/*****************************************************************************/
/*                                外部変数宣言                               */
/*****************************************************************************/


/*****************************************************************************/
/*                                外部定数定義                               */
/*****************************************************************************/


/*****************************************************************************/
/*                                  外部関数                                 */
/*****************************************************************************/


/*****************************************************************************/
/*                                  関数実装                                 */
/*****************************************************************************/
/**
 *  @brief  Get touch sensor state, if pressed, sets true(1) to variable,
 *          otherwise sets false(0) to it.
 */
void get_touch_state(void) {
    touch_sensor_state = ev3_touch_sensor_is_pressed(touch_sensor_port);
}

/**
 *  @brief  Initialize touch sensor.
 */
void init_touch_sensor(void) {
    ER ret;
    
    ret = ev3_sensor_config(touch_sensor_port, TOUCH_SENSOR);
    if (E_OK == ret) {
        touch_sensor_config = 0;
    } else if (E_ID == ret) {
        touch_sensor_config = 1;
    } else if (E_PAR == ret) {
        touch_sensor_config = 2;
    } else {
        touch_sensor_config = 3;
    }
}
